

class BasisVariables{
   static Map rulesJson = {
    "站点名称":"",
    "站点分类":"",
    "首页URL":"",
    "搜索URL":"",
    "登录URL":"",
    "Cookie":"",
    "分类":{},
    "首页规则":{
      "Item":"",
      "Item URL":"",
      "标题":"",
      "作者":"",
      "封面":"",
      "简介":"",
      "上传时间":"",
      "评分":"",
      "类别":"",
    },
    "搜索规则":{
      "Item":"",
      "Item URL":"",
      "标题":"",
      "作者":"",
      "封面":"",
      "简介":"",
      "上传时间":"",
      "评分":"",
      "类别":"",
    },
    "目录规则":{
      "Item":"",
      "Item URL":"",
      "标题":"",
      "作者":"",
      "封面":"",
      "简介":"",
      "上传时间":"",
      "评分":"",
      "类别":"",
    },
    "图片规则":{
      "Item":"",
      "Item URL":"",
      "标题":"",
      "作者":"",
      "封面":"",
      "简介":"",
      "上传时间":"",
      "评分":"",
      "类别":"",
    }
  };
}
